OpenFOAM-2.3.1/tutorials/combustion/fireFoam/les/smallPoolFire3D/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh
runApplication topoSet
runApplication createPatch -overwrite
runApplication decomposePar -force

# Run
runParallel $application 4

# -----------------------------------------------------------------------------
